stm32-rs/stm32f4xx-hal/src/dma/traits.rs
    /// Set peripheral burst mode (pburst) of the DMA stream.
    fn set_peripheral_burst(&mut self, peripheral_burst: config::BurstMode);

    /// Get the current fifo level (fs) of the DMA stream.
    fn fifo_level() -> FifoLevel;

    /// Get which buffer is currently in use by the DMA.
    fn current_buffer() -> CurrentBuffer;
}

/// DMA direction.
pub trait Direction: Bits<u8> {
    /// Creates a new instance of the type.
    fn new() -> Self;

    /// Returns the `DmaDirection` of the type.
    fn direction() -> DmaDirection;
}

/// Get an address and memory size the DMA can use.
///
/// # Safety
///
/// Both the memory size and the address must be correct for the specific peripheral and for the
/// DMA.
pub unsafe trait PeriAddress {
    /// Memory size of the peripheral.
    type MemSize;

    /// Returns the address to be used by the DMA stream.
    fn address(&self) -> u32;
}

// Convenience macro for implementing addresses on peripherals
macro_rules! address {
    ($(($peripheral:ty, $register:ident, $size: ty)),+ $(,)*) => {
        $(
            unsafe impl PeriAddress for $peripheral {
                #[inline(always)]
                fn address(&self) -> u32 {
                    &self.$register as *const _ as u32
                }

                type MemSize = $size;
            }
        )+
    };
}

impl Sealed for DMA1 {}
impl Sealed for DMA2 {}

#[cfg(not(any(
    feature = "stm32f411",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f410"
)))]
/// Type alias to a DMA RegisterBlock.
pub type DMARegisterBlock = pac::dma2::RegisterBlock;

#[cfg(any(
    feature = "stm32f411",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f410"
))]
/// Type alias to a DMA RegisterBlock.
pub type DMARegisterBlock = pac::dma1::RegisterBlock;

/// Trait that represents an instance of a DMA peripheral.
pub trait Instance: Deref<Target = DMARegisterBlock> + Sealed {
    /// Gives a pointer to the RegisterBlock.
    fn ptr() -> *const DMARegisterBlock;
}

impl Instance for DMA1 {
    #[inline(always)]
    fn ptr() -> *const DMARegisterBlock {
        DMA1::ptr()
    }
}

impl Instance for DMA2 {
    #[inline(always)]
    fn ptr() -> *const DMARegisterBlock {
        DMA2::ptr()
    }
}

/// A channel that can be configured on a DMA stream.
pub trait Channel {}

/// Trait to mark a set of Stream, Channel and Direction for a Peripheral as correct together.
///
/// # Safety
///
/// Memory corruption might occur if this trait is implemented for an invalid combination.
pub unsafe trait DMASet<STREAM, const CHANNEL: u8, DIRECTION> {}

macro_rules! dma_map {
    ($(($Stream:ty, $C:literal, $Peripheral:ty, $Dir:ty)),+ $(,)*) => {
        $(
            unsafe impl DMASet<$Stream, $C, $Dir> for $Peripheral {}
        )+
    };
}

macro_rules! dma_spi_map {
    ($(($Stream:ty, $C:literal, $RxTx:ident, $Peripheral:ty, $Dir:ty)),+ $(,)*) => {
        $(
            unsafe impl<PINS, const BIDI: bool, OPERATION>
            DMASet<$Stream, $C, $Dir> for spi::$RxTx<$Peripheral, PINS, BIDI, OPERATION> {}

            paste! {
                unsafe impl<PINS, const BIDI: bool, OPERATION>
                DMASet<$Stream, $C, $Dir> for spi::[<$RxTx Coupled>]<$Peripheral, PINS, BIDI, OPERATION> {}
            }
        )+
    };
}

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, 2, timer::CCR1<pac::TIM4>, MemoryToPeripheral), //TIM4_CH1
    (Stream0<DMA1>, 2, timer::CCR1<pac::TIM4>, PeripheralToMemory), //TIM4_CH1
    (Stream2<DMA1>, 5, timer::CCR4<pac::TIM3>, MemoryToPeripheral), //TIM3_CH4
    (Stream2<DMA1>, 5, timer::CCR4<pac::TIM3>, PeripheralToMemory), //TIM3_CH4
    (Stream2<DMA1>, 5, timer::DMAR<pac::TIM3>, MemoryToPeripheral), //TIM3_UP
    (Stream2<DMA1>, 5, timer::DMAR<pac::TIM3>, PeripheralToMemory), //TIM3_UP
    (Stream3<DMA1>, 2, timer::CCR2<pac::TIM4>, MemoryToPeripheral), //TIM4_CH2
    (Stream3<DMA1>, 2, timer::CCR2<pac::TIM4>, PeripheralToMemory), //TIM4_CH2
    (Stream4<DMA1>, 5, timer::CCR1<pac::TIM3>, MemoryToPeripheral), //TIM3_CH1
    (Stream4<DMA1>, 5, timer::CCR1<pac::TIM3>, PeripheralToMemory), //TIM3_CH1
    (Stream4<DMA1>, 5, timer::DMAR<pac::TIM3>, MemoryToPeripheral), //TIM3_TRIG
    (Stream4<DMA1>, 5, timer::DMAR<pac::TIM3>, PeripheralToMemory), //TIM3_TRIG
    (Stream5<DMA1>, 3, timer::CCR1<pac::TIM2>, MemoryToPeripheral), //TIM2_CH1
    (Stream5<DMA1>, 3, timer::CCR1<pac::TIM2>, PeripheralToMemory), //TIM2_CH1
    (Stream5<DMA1>, 5, timer::CCR2<pac::TIM3>, MemoryToPeripheral), //TIM3_CH2
    (Stream5<DMA1>, 5, timer::CCR2<pac::TIM3>, PeripheralToMemory), //TIM3_CH2
    (Stream6<DMA1>, 2, timer::DMAR<pac::TIM4>, MemoryToPeripheral), //TIM4_UP
    (Stream6<DMA1>, 2, timer::DMAR<pac::TIM4>, PeripheralToMemory), //TIM4_UP
    (Stream6<DMA1>, 3, timer::CCR2<pac::TIM2>, MemoryToPeripheral), //TIM2_CH2
    (Stream6<DMA1>, 3, timer::CCR2<pac::TIM2>, PeripheralToMemory), //TIM2_CH2
    (Stream6<DMA1>, 3, timer::CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream6<DMA1>, 3, timer::CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream7<DMA1>, 2, timer::CCR3<pac::TIM4>, MemoryToPeripheral), //TIM4_CH3
    (Stream7<DMA1>, 2, timer::CCR3<pac::TIM4>, PeripheralToMemory), //TIM4_CH3
    (Stream7<DMA1>, 5, timer::CCR3<pac::TIM3>, MemoryToPeripheral), //TIM3_CH3
    (Stream7<DMA1>, 5, timer::CCR3<pac::TIM3>, PeripheralToMemory), //TIM3_CH3
    (Stream0<DMA1>, 0, pac::SPI3, PeripheralToMemory),       //SPI3_RX
    (Stream2<DMA1>, 0, pac::SPI3, PeripheralToMemory),       //SPI3_RX
    (Stream4<DMA1>, 3, pac::I2C3, MemoryToPeripheral),       //I2C3_TX
    (Stream5<DMA1>, 0, pac::SPI3, MemoryToPeripheral),       //SPI3_TX
    (Stream7<DMA1>, 0, pac::SPI3, MemoryToPeripheral),       //SPI3_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream0<DMA1>, 0, Rx, pac::SPI3, PeripheralToMemory), //SPI3_RX
    (Stream2<DMA1>, 0, Rx, pac::SPI3, PeripheralToMemory), //SPI3_RX
    (Stream5<DMA1>, 0, Tx, pac::SPI3, MemoryToPeripheral), //SPI3_TX
    (Stream7<DMA1>, 0, Tx, pac::SPI3, MemoryToPeripheral), //SPI3_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::SPI3, dr, u8), (pac::I2C3, dr, u8),);

#[cfg(not(any(feature = "stm32f410")))]
dma_map!(
    (Stream3<DMA2>, 4, pac::SDIO, MemoryToPeripheral), //SDIO
    (Stream3<DMA2>, 4, pac::SDIO, PeripheralToMemory), //SDIO
    (Stream6<DMA2>, 4, pac::SDIO, MemoryToPeripheral), //SDIO
    (Stream6<DMA2>, 4, pac::SDIO, PeripheralToMemory), //SDIO
);

#[cfg(not(any(feature = "stm32f410")))]
address!((pac::SDIO, fifo, u32),);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, 6, timer::CCR3<pac::TIM5>, MemoryToPeripheral), //TIM5_CH3
    (Stream0<DMA1>, 6, timer::CCR3<pac::TIM5>, PeripheralToMemory), //TIM5_CH3
    (Stream0<DMA1>, 6, timer::DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_UP
    (Stream0<DMA1>, 6, timer::DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_UP
    (Stream1<DMA1>, 6, timer::CCR4<pac::TIM5>, MemoryToPeripheral), //TIM5_CH4
    (Stream1<DMA1>, 6, timer::CCR4<pac::TIM5>, PeripheralToMemory), //TIM5_CH4
    (Stream1<DMA1>, 6, timer::DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_TRIG
    (Stream1<DMA1>, 6, timer::DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_TRIG
    (Stream2<DMA1>, 6, timer::CCR1<pac::TIM5>, MemoryToPeripheral), //TIM5_CH1
    (Stream2<DMA1>, 6, timer::CCR1<pac::TIM5>, PeripheralToMemory), //TIM5_CH1
    (Stream3<DMA1>, 6, timer::CCR4<pac::TIM5>, MemoryToPeripheral), //TIM5_CH4
    (Stream3<DMA1>, 6, timer::CCR4<pac::TIM5>, PeripheralToMemory), //TIM5_CH4
    (Stream3<DMA1>, 6, timer::DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_TRIG
    (Stream3<DMA1>, 6, timer::DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_TRIG
    (Stream4<DMA1>, 6, timer::CCR2<pac::TIM5>, MemoryToPeripheral), //TIM5_CH2
    (Stream4<DMA1>, 6, timer::CCR2<pac::TIM5>, PeripheralToMemory), //TIM5_CH2
    (Stream6<DMA1>, 6, timer::DMAR<pac::TIM5>, MemoryToPeripheral), //TIM5_UP
    (Stream6<DMA1>, 6, timer::DMAR<pac::TIM5>, PeripheralToMemory), //TIM5_UP
    (Stream0<DMA2>, 6, timer::DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_TRIG
    (Stream0<DMA2>, 6, timer::DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_TRIG
    (Stream1<DMA2>, 6, timer::CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream1<DMA2>, 6, timer::CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream2<DMA2>, 6, timer::CCR2<pac::TIM1>, MemoryToPeripheral), //TIM1_CH2
    (Stream2<DMA2>, 6, timer::CCR2<pac::TIM1>, PeripheralToMemory), //TIM1_CH2
    (Stream3<DMA2>, 6, timer::CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream3<DMA2>, 6, timer::CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream4<DMA2>, 6, timer::CCR4<pac::TIM1>, MemoryToPeripheral), //TIM1_CH4
    (Stream4<DMA2>, 6, timer::CCR4<pac::TIM1>, PeripheralToMemory), //TIM1_CH4
    (Stream4<DMA2>, 6, timer::DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_TRIG/COM
    (Stream4<DMA2>, 6, timer::DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_TRIG/COM
    (Stream5<DMA2>, 6, timer::DMAR<pac::TIM1>, MemoryToPeripheral), //TIM1_UP
    (Stream5<DMA2>, 6, timer::DMAR<pac::TIM1>, PeripheralToMemory), //TIM1_UP
    (Stream6<DMA2>, 0, timer::CCR1<pac::TIM1>, MemoryToPeripheral), //TIM1_CH1
    (Stream6<DMA2>, 0, timer::CCR1<pac::TIM1>, PeripheralToMemory), //TIM1_CH1
    (Stream6<DMA2>, 0, timer::CCR2<pac::TIM1>, MemoryToPeripheral), //TIM1_CH2
    (Stream6<DMA2>, 0, timer::CCR2<pac::TIM1>, PeripheralToMemory), //TIM1_CH2
    (Stream6<DMA2>, 0, timer::CCR3<pac::TIM1>, MemoryToPeripheral), //TIM1_CH3
    (Stream6<DMA2>, 0, timer::CCR3<pac::TIM1>, PeripheralToMemory), //TIM1_CH3
    (Stream6<DMA2>, 6, timer::CCR3<pac::TIM1>, MemoryToPeripheral), //TIM1_CH3
    (Stream6<DMA2>, 6, timer::CCR3<pac::TIM1>, PeripheralToMemory), //TIM1_CH3
    (Stream0<DMA1>, 1, pac::I2C1, PeripheralToMemory),       //I2C1_RX
    (Stream2<DMA1>, 7, pac::I2C2, PeripheralToMemory),       //I2C2_RX
    (Stream3<DMA1>, 0, pac::SPI2, PeripheralToMemory),       //SPI2_RX
    (Stream3<DMA1>, 7, pac::I2C2, PeripheralToMemory),       //I2C2_RX
    (Stream4<DMA1>, 0, pac::SPI2, MemoryToPeripheral),       //SPI2_TX
    (Stream5<DMA1>, 1, pac::I2C1, PeripheralToMemory),       //I2C1_RX
    (Stream5<DMA1>, 4, pac::USART2, PeripheralToMemory),     //USART2_RX
    (Stream5<DMA1>, 4, serial::Rx<pac::USART2>, PeripheralToMemory), //USART2_RX
    (Stream6<DMA1>, 4, pac::USART2, MemoryToPeripheral),     //USART2_TX
    (Stream6<DMA1>, 4, serial::Tx<pac::USART2>, MemoryToPeripheral), //USART2_TX
    (Stream7<DMA1>, 7, pac::I2C2, MemoryToPeripheral),       //I2C2_TX
    (Stream0<DMA2>, 0, pac::ADC1, PeripheralToMemory),       //ADC1
    (Stream0<DMA2>, 0, Adc<pac::ADC1>, PeripheralToMemory),
    (Stream0<DMA2>, 3, pac::SPI1, PeripheralToMemory), //SPI1_RX
    (Stream1<DMA2>, 5, pac::USART6, PeripheralToMemory), //USART6_RX
    (Stream1<DMA2>, 5, serial::Rx<pac::USART6>, PeripheralToMemory), //USART6_RX
    (Stream2<DMA2>, 3, pac::SPI1, PeripheralToMemory), //SPI1_RX
    (Stream2<DMA2>, 4, pac::USART1, PeripheralToMemory), //USART1_RX
    (Stream2<DMA2>, 4, serial::Rx<pac::USART1>, PeripheralToMemory), //USART1_RX
    (Stream2<DMA2>, 5, pac::USART6, PeripheralToMemory), //USART6_RX
    (Stream2<DMA2>, 5, serial::Rx<pac::USART6>, PeripheralToMemory), //USART6_RX
    (Stream4<DMA2>, 0, pac::ADC1, PeripheralToMemory), //ADC1
    (Stream5<DMA2>, 4, pac::USART1, PeripheralToMemory), //USART1_RX
    (Stream5<DMA2>, 4, serial::Rx<pac::USART1>, PeripheralToMemory), //USART1_RX
    (Stream6<DMA2>, 5, pac::USART6, MemoryToPeripheral), //USART6_TX
    (Stream6<DMA2>, 5, serial::Tx<pac::USART6>, MemoryToPeripheral), //USART6_TX
    (Stream7<DMA2>, 4, pac::USART1, MemoryToPeripheral), //USART1_TX
    (Stream7<DMA2>, 4, serial::Tx<pac::USART1>, MemoryToPeripheral), //USART1_TX
    (Stream7<DMA2>, 5, pac::USART6, MemoryToPeripheral), //USART6_TX
    (Stream7<DMA2>, 5, serial::Tx<pac::USART6>, MemoryToPeripheral), //USART6_TX
    (Stream0<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream1<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream2<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream3<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream4<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream5<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream6<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream7<DMA2>, 0, MemoryToMemory<u8>, MemoryToMemory<u8>),
    (Stream0<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream1<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream2<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream3<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream4<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream5<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream6<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream7<DMA2>, 0, MemoryToMemory<u16>, MemoryToMemory<u16>),
    (Stream0<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream1<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream2<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream3<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream4<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream5<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream6<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
    (Stream7<DMA2>, 0, MemoryToMemory<u32>, MemoryToMemory<u32>),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream3<DMA1>, 0, Rx, pac::SPI2, PeripheralToMemory), //SPI2_RX
    (Stream4<DMA1>, 0, Tx, pac::SPI2, MemoryToPeripheral), // SPI2_TX
    (Stream0<DMA2>, 3, Rx, pac::SPI1, PeripheralToMemory), //SPI1_RX
    (Stream2<DMA2>, 3, Rx, pac::SPI1, PeripheralToMemory), //SPI1_RX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::ADC1, dr, u16),
    (pac::I2C1, dr, u8),
    (pac::I2C2, dr, u8),
    (pac::SPI1, dr, u8),
    (pac::SPI2, dr, u8),
    (pac::USART1, dr, u8),
    (pac::USART2, dr, u8),
    (pac::USART6, dr, u8),
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
))]
dma_map!(
    (Stream1<DMA1>, 1, pac::I2C3, PeripheralToMemory), //I2C3_RX
    (Stream2<DMA1>, 3, pac::I2C3, PeripheralToMemory), //I2C3_RX:DMA_CHANNEL_3
);

#[cfg(any(feature = "stm32f401", feature = "stm32f411",))]
dma_map!(
    (Stream1<DMA1>, 3, timer::CCR3<pac::TIM2>, MemoryToPeripheral), //TIM2_CH3
    (Stream1<DMA1>, 3, timer::CCR3<pac::TIM2>, PeripheralToMemory), //TIM2_CH3
    (Stream1<DMA1>, 3, timer::DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream1<DMA1>, 3, timer::DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream7<DMA1>, 3, timer::CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream7<DMA1>, 3, timer::CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream7<DMA1>, 3, timer::DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream7<DMA1>, 3, timer::DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!((Stream5<DMA1>, 6, pac::I2C3, MemoryToPeripheral),); //I2C3_TX:DMA_CHANNEL_6);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream6<DMA1>, 1, pac::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream7<DMA1>, 1, pac::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream3<DMA2>, 3, pac::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream5<DMA2>, 3, pac::SPI1, MemoryToPeripheral), //SPI1_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream3<DMA2>, 3, Tx, pac::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream5<DMA2>, 3, Tx, pac::SPI1, MemoryToPeripheral), //SPI1_TX
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA2>, 4, pac::SPI4, PeripheralToMemory), //SPI4_RX
    (Stream1<DMA2>, 4, pac::SPI4, MemoryToPeripheral), //SPI4_TX
    (Stream3<DMA2>, 5, pac::SPI4, PeripheralToMemory), //SPI4_RX:DMA_CHANNEL_5
    (Stream4<DMA2>, 5, pac::SPI4, MemoryToPeripheral), //SPI4_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream0<DMA2>, 4, Rx, pac::SPI4, PeripheralToMemory), //SPI4_RX
    (Stream1<DMA2>, 4, Tx, pac::SPI4, MemoryToPeripheral), //SPI4_TX
    (Stream3<DMA2>, 5, Rx, pac::SPI4, PeripheralToMemory), //SPI4_RX:DMA_CHANNEL_5
    (Stream4<DMA2>, 5, Tx, pac::SPI4, MemoryToPeripheral), //SPI4_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f401",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::SPI4, dr, u8),);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, 4, pac::UART5, PeripheralToMemory), //UART5_RX
    (Stream2<DMA1>, 4, pac::UART4, PeripheralToMemory), //UART4_RX
    (Stream4<DMA1>, 4, pac::UART4, MemoryToPeripheral), //UART4_TX
    //(Stream6<DMA1>, 7, pac::DAC2, MemoryToPeripheral), //DAC2
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::UART4, dr, u8),
    (pac::UART5, dr, u8),
    //(pac::DAC, ??),
);

