stm32-rs/stm32f4xx-hal/src/dma/traits.rs
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream1<DMA1>, 3, timer::DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream1<DMA1>, 3, timer::DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream1<DMA1>, 3, timer::CCR3<pac::TIM2>, MemoryToPeripheral), //TIM2_CH3
    (Stream1<DMA1>, 3, timer::CCR3<pac::TIM2>, PeripheralToMemory), //TIM2_CH3
    //(pac::DMA1, Stream2, 1, timer::DMAR<pac::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream2, 1, timer::DMAR<pac::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream4, 1, timer::DMAR<pac::TIM7>, MemoryToPeripheral), //TIM7_UP //dmar register appears to be missing
    //(pac::DMA1, Stream4, 1, timer::DMAR<pac::TIM7>, PeripheralToMemory), //TIM7_UP //dmar register appears to be missing
    (Stream7<DMA1>, 3, timer::DMAR<pac::TIM2>, MemoryToPeripheral), //TIM2_UP
    (Stream7<DMA1>, 3, timer::DMAR<pac::TIM2>, PeripheralToMemory), //TIM2_UP
    (Stream7<DMA1>, 3, timer::CCR4<pac::TIM2>, MemoryToPeripheral), //TIM2_CH4
    (Stream7<DMA1>, 3, timer::CCR4<pac::TIM2>, PeripheralToMemory), //TIM2_CH4
    (Stream1<DMA2>, 7, timer::DMAR<pac::TIM8>, MemoryToPeripheral), //TIM8_UP
    (Stream1<DMA2>, 7, timer::DMAR<pac::TIM8>, PeripheralToMemory), //TIM8_UP
    (Stream2<DMA2>, 0, timer::CCR1<pac::TIM8>, MemoryToPeripheral), //TIM8_CH1
    (Stream2<DMA2>, 0, timer::CCR1<pac::TIM8>, PeripheralToMemory), //TIM8_CH1
    (Stream2<DMA2>, 0, timer::CCR2<pac::TIM8>, MemoryToPeripheral), //TIM8_CH2
    (Stream2<DMA2>, 0, timer::CCR2<pac::TIM8>, PeripheralToMemory), //TIM8_CH2
    (Stream2<DMA2>, 0, timer::CCR3<pac::TIM8>, MemoryToPeripheral), //TIM8_CH3
    (Stream2<DMA2>, 0, timer::CCR3<pac::TIM8>, PeripheralToMemory), //TIM8_CH3
    (Stream2<DMA2>, 7, timer::CCR1<pac::TIM8>, MemoryToPeripheral), //TIM8_CH1
    (Stream2<DMA2>, 7, timer::CCR1<pac::TIM8>, PeripheralToMemory), //TIM8_CH1
    (Stream3<DMA2>, 7, timer::CCR2<pac::TIM8>, MemoryToPeripheral), //TIM8_CH2
    (Stream3<DMA2>, 7, timer::CCR2<pac::TIM8>, PeripheralToMemory), //TIM8_CH2
    (Stream4<DMA2>, 7, timer::CCR3<pac::TIM8>, MemoryToPeripheral), //TIM8_CH3
    (Stream4<DMA2>, 7, timer::CCR3<pac::TIM8>, PeripheralToMemory), //TIM8_CH3
    (Stream7<DMA2>, 7, timer::CCR4<pac::TIM8>, MemoryToPeripheral), //TIM8_CH4
    (Stream7<DMA2>, 7, timer::CCR4<pac::TIM8>, PeripheralToMemory), //TIM8_CH4
    (Stream7<DMA2>, 7, timer::DMAR<pac::TIM8>, MemoryToPeripheral), //TIM8_COM/TRIG
    (Stream7<DMA2>, 7, timer::DMAR<pac::TIM8>, PeripheralToMemory), //TIM8_COM/TRIG
    (Stream1<DMA1>, 4, pac::USART3, PeripheralToMemory),     //USART3_RX
    (Stream1<DMA1>, 4, serial::Rx<pac::USART3>, PeripheralToMemory), //USART3_RX
    (Stream3<DMA1>, 4, pac::USART3, MemoryToPeripheral),     //USART3_TX
    (Stream3<DMA1>, 4, serial::Tx<pac::USART3>, MemoryToPeripheral), //USART3_TX
    (Stream4<DMA1>, 7, pac::USART3, MemoryToPeripheral),     //USART3_TX:DMA_CHANNEL_7
    (Stream4<DMA1>, 7, serial::Tx<pac::USART3>, MemoryToPeripheral), //USART3_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::USART3, dr, u8),);

/*
DMAR register appears to be missing from TIM6 derived timers on these devices
   Not sure how _UP is supposed to work without DMAR or if this is just an SVD issue
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (pac::DMA1, Stream1, 7, timer::DMAR<pac::TIM6>, MemoryToPeripheral), //TIM6_UP
    (pac::DMA1, Stream1, 7, timer::DMAR<pac::TIM6>, PeripheralToMemory), //TIM6_UP
);
*/

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream2<DMA1>, 3, pac::I2C3, PeripheralToMemory), //I2C3_RX
    (Stream5<DMA2>, 2, pac::CRYP, PeripheralToMemory), //CRYP_OUT
    (Stream6<DMA2>, 2, pac::CRYP, MemoryToPeripheral), //CRYP_IN
    (Stream7<DMA2>, 2, pac::HASH, MemoryToPeripheral), //HASH_IN
);

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::HASH, din, u32), (pac::CRYP, din, u32),);

/* Not sure how DAC works with DMA
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (pac::DMA1, Stream5, 7, pac::DAC, MemoryToPeripheral), //DAC1
);
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f410",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::DAC, ??),
);
*/

#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream7<DMA1>, 4, pac::UART5, MemoryToPeripheral), //UART5_TX
    (Stream0<DMA2>, 2, pac::ADC3, PeripheralToMemory),  //ADC3
    (Stream1<DMA2>, 1, pac::DCMI, PeripheralToMemory),  //DCMI
    (Stream1<DMA2>, 2, pac::ADC3, PeripheralToMemory),  //ADC3
    (Stream2<DMA2>, 1, pac::ADC2, PeripheralToMemory),  //ADC2
    (Stream3<DMA2>, 1, pac::ADC2, PeripheralToMemory),  //ADC2
    (Stream7<DMA2>, 1, pac::DCMI, PeripheralToMemory),  //DCMI
    (Stream2<DMA2>, 1, Adc<pac::ADC3>, PeripheralToMemory), //ADC2
    (Stream3<DMA2>, 1, Adc<pac::ADC3>, PeripheralToMemory), //ADC2
    (Stream0<DMA2>, 2, Adc<pac::ADC3>, PeripheralToMemory), //ADC3
    (Stream1<DMA2>, 2, Adc<pac::ADC3>, PeripheralToMemory), //ADC3
);
#[cfg(any(
    feature = "stm32f417",
    feature = "stm32f415",
    feature = "stm32f405",
    feature = "stm32f407",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::ADC2, dr, u16),
    (pac::ADC3, dr, u16),
    (pac::DCMI, dr, u32),
);

/* FMPI2C missing from peripheral crates (?)
#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (pac::DMA1, Stream0, 7, pac::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX
    (pac::DMA1, Stream1, 2, pac::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX
    (pac::DMA1, Stream3, 1, pac::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX:DMA_CHANNEL_1
    (pac::DMA1, Stream7, 4, pac::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX:DMA_CHANNEL_4
);

// TODO: Probably need to create other type for tx_dr and rx_dr
#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
address!(
    (pac::FMPI2C1, dr),
);
*/

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (Stream1<DMA1>, 0, pac::I2C1, MemoryToPeripheral), //I2C1_TX
    (Stream6<DMA1>, 1, pac::I2C1, MemoryToPeripheral), //I2C1_TX:DMA_CHANNEL_1
    (Stream7<DMA1>, 1, pac::I2C1, MemoryToPeripheral), //I2C1_TX:DMA_CHANNEL_1
    (Stream7<DMA1>, 6, pac::USART2, PeripheralToMemory), //USART2_RX:DMA_CHANNEL_6
    (Stream2<DMA2>, 2, pac::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream3<DMA2>, 3, pac::SPI1, MemoryToPeripheral), //SPI1_TX:DMA_CHANNEL_3
    (Stream5<DMA2>, 3, pac::SPI1, MemoryToPeripheral), //SPI1_TX:DMA_CHANNEL_3
    (Stream5<DMA2>, 5, pac::SPI5, MemoryToPeripheral), //SPI5_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_spi_map!(
    (Stream2<DMA2>, 2, Tx, pac::SPI1, MemoryToPeripheral), //SPI1_TX
    (Stream3<DMA2>, 3, Tx, pac::SPI1, MemoryToPeripheral), //SPI1_TX:DMA_CHANNEL_3
    (Stream5<DMA2>, 3, Tx, pac::SPI1, MemoryToPeripheral), //SPI1_TX:DMA_CHANNEL_3
    (Stream5<DMA2>, 5, Tx, pac::SPI5, MemoryToPeripheral), //SPI5_TX:DMA_CHANNEL_5
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream3<DMA2>, 2, pac::SPI5, PeripheralToMemory), //SPI5_RX
    (Stream4<DMA2>, 2, pac::SPI5, MemoryToPeripheral), //SPI5_TX
    (Stream5<DMA2>, 7, pac::SPI5, PeripheralToMemory), //SPI5_RX:DMA_CHANNEL_7
    (Stream6<DMA2>, 7, pac::SPI5, MemoryToPeripheral), //SPI5_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream3<DMA2>, 2, Rx, pac::SPI5, PeripheralToMemory), //SPI5_RX
    (Stream4<DMA2>, 2, Tx, pac::SPI5, MemoryToPeripheral), //SPI5_TX
    (Stream5<DMA2>, 7, Rx, pac::SPI5, PeripheralToMemory), //SPI5_RX:DMA_CHANNEL_7
    (Stream6<DMA2>, 7, Tx, pac::SPI5, MemoryToPeripheral), //SPI5_TX:DMA_CHANNEL_7
);

#[cfg(any(
    feature = "stm32f410",
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::SPI5, dr, u8),);

#[cfg(any(
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_map!(
    (Stream4<DMA2>, 4, pac::SPI4, PeripheralToMemory), //SPI4_RX);
);

#[cfg(any(
    feature = "stm32f411",
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
))]
dma_spi_map!(
    (Stream4<DMA2>, 4, Rx, pac::SPI4, PeripheralToMemory), // SPI4_RX
);

