stm32-rs/stm32f4xx-hal/src/dma/traits.rs
/* TODO: DFSDM support
#[cfg(feature = "stm32f412")]
dma_map!(
    (Stream0<pac::DMA2>, 7, pac::DFSDM, PeripheralToMemory), //DFSDM1_FLT0
    (Stream1<pac::DMA2>, 3, pac::DFSDM, PeripheralToMemory), //DFSDM1_FLT1
    (Stream4<pac::DMA2>, 3, pac::DFSDM, PeripheralToMemory), //DFSDM1_FLT1
    (Stream6<pac::DMA2>, 3, pac::DFSDM, PeripheralToMemory), //DFSDM1_FLT0:DMA_CHANNEL_3
);
#[cfg(feature = "stm32f412")]
address!((pac::DFSDM, dr),);

#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
dma_map!(
    (Stream0<pac::DMA2>, 7, pac::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0
    (Stream1<pac::DMA2>, 3, pac::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (Stream4<pac::DMA2>, 3, pac::DFSDM1, PeripheralToMemory), //DFSDM1_FLT1
    (Stream6<pac::DMA2>, 3, pac::DFSDM1, PeripheralToMemory), //DFSDM1_FLT0:DMA_CHANNEL_3
    (Stream0<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
    (Stream1<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
    (Stream2<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
    (Stream3<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
    (Stream4<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT0
    (Stream5<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT1
    (Stream6<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT2
    (Stream7<pac::DMA2>, 8, pac::DFSDM2, PeripheralToMemory), //DFSDM2_FLT3
);
#[cfg(any(feature = "stm32f413", feature = "stm32f423"))]
address!((pac::DFSDM1, dr), (pac::DFSDM2, dr),);
*/

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream7<DMA2>, 3, pac::QUADSPI, MemoryToPeripheral), //QUADSPI
    (Stream7<DMA2>, 3, pac::QUADSPI, PeripheralToMemory), //QUADSPI
);

#[cfg(any(
    feature = "stm32f412",
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::QUADSPI, dr, u32),);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream0<DMA1>, 5, pac::UART8, MemoryToPeripheral), //UART8_TX
    (Stream1<DMA1>, 5, pac::UART7, MemoryToPeripheral), //UART7_TX
    (Stream3<DMA1>, 5, pac::UART7, PeripheralToMemory), //UART7_RX
    (Stream6<DMA1>, 5, pac::UART8, PeripheralToMemory), //UART8_RX
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::UART7, dr, u8), (pac::UART8, dr, u8),);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
dma_map!(
    (Stream7<DMA1>, 8, pac::UART5, MemoryToPeripheral), //UART5_TX
    (Stream0<DMA2>, 1, pac::UART9, MemoryToPeripheral), //UART9_TX
    (Stream0<DMA2>, 5, pac::UART10, PeripheralToMemory), //UART10_RX
    (Stream3<DMA2>, 9, pac::UART10, PeripheralToMemory), //UART10_RX:DMA_CHANNEL_9
    (Stream5<DMA2>, 9, pac::UART10, MemoryToPeripheral), //UART10_TX
    (Stream7<DMA2>, 0, pac::UART9, PeripheralToMemory), //UART9_RX
    (Stream7<DMA2>, 6, pac::UART10, MemoryToPeripheral), //UART10_TX:DMA_CHANNEL_6
    //(pac::DMA2, Stream6, 2, IN<pac::AES>, MemoryToPeripheral), //AES_IN
    //(pac::DMA2, Stream5, 2, OUT<pac::AES>, PeripheralToMemory), //AES_OUT
);

#[cfg(any(feature = "stm32f413", feature = "stm32f423",))]
address!(
    //(IN<pac::AES>, dinr),
    //(OUT<pac::AES>, doutr),
    (pac::UART9, dr, u8),
    (pac::UART10, dr, u8),
);

/* Not sure how SAI works
#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (pac::DMA2, Stream1, 0, pac::SAI, MemoryToPeripheral), //SAI1_A
    (pac::DMA2, Stream1, 0, pac::SAI, PeripheralToMemory), //SAI1_A
    (pac::DMA2, Stream3, 0, pac::SAI, MemoryToPeripheral), //SAI1_A
    (pac::DMA2, Stream3, 0, pac::SAI, PeripheralToMemory), //SAI1_A
    (pac::DMA2, Stream4, 1, pac::SAI, MemoryToPeripheral), //SAI1_B
    (pac::DMA2, Stream4, 1, pac::SAI, PeripheralToMemory), //SAI1_B
    (pac::DMA2, Stream5, 0, pac::SAI, MemoryToPeripheral), //SAI1_B:DMA_CHANNEL_0
    (pac::DMA2, Stream5, 0, pac::SAI, PeripheralToMemory), //SAI1_B:DMA_CHANNEL_0
);

#[cfg(any(
    feature = "stm32f413",
    feature = "stm32f423",
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f446",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!(
    (pac::SAI, dr),
);
*/

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_map!(
    (Stream5<DMA2>, 1, pac::SPI6, MemoryToPeripheral), //SPI6_TX
    (Stream6<DMA2>, 1, pac::SPI6, PeripheralToMemory), //SPI6_RX
);

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
dma_spi_map!(
    (Stream5<DMA2>, 1, Tx, pac::SPI6, MemoryToPeripheral), //SPI6_TX
    (Stream6<DMA2>, 1, Rx, pac::SPI6, PeripheralToMemory), //SPI6_RX
);

#[cfg(any(
    feature = "stm32f427",
    feature = "stm32f439",
    feature = "stm32f437",
    feature = "stm32f429",
    feature = "stm32f469",
    feature = "stm32f479",
))]
address!((pac::SPI6, dr, u8),);

/*
#[cfg(any(
    feature = "stm32f446",
))]
dma_map!(
    (pac::DMA1, Stream1, 0, pac::SPDIFRX, PeripheralToMemory), //SPDIF_RX_DT
    (pac::DMA1, Stream2, 2, pac::FMPI2C1, PeripheralToMemory), //FMPI2C1_RX
    (pac::DMA1, Stream5, 2, pac::FMPI2C1, MemoryToPeripheral), //FMPI2C1_TX
    (pac::DMA1, Stream6, 0, pac::SPDIFRX, PeripheralToMemory), //SPDIF_RX_CS
    (pac::DMA2, Stream4, 3, pac::SAI2, MemoryToPeripheral), //SAI2_A
    (pac::DMA2, Stream4, 3, pac::SAI2, PeripheralToMemory), //SAI2_A
    (pac::DMA2, Stream6, 3, pac::SAI2, MemoryToPeripheral), //SAI2_B
    (pac::DMA2, Stream6, 3, pac::SAI2, PeripheralToMemory), //SAI2_B
    (pac::DMA2, Stream7, 0, pac::SAI2, MemoryToPeripheral), //SAI2_B:DMA_CHANNEL_0
    (pac::DMA2, Stream7, 0, pac::SAI2, PeripheralToMemory), //SAI2_B:DMA_CHANNEL_0
);
#[cfg(any(
    feature = "stm32f446",
))]
address!(
    (pac::SPDIFRX, ??),
    (pac::FMPI2C1, ??),
    (pac::SAI2, ??),
);
*/
